<?php
// = присваивание
$var = 1;

// +=
$i = 1;
$i = $i + 1;
$i += 1;
$i++; // инкремент

// -=
$i = 1;
$i = $i - 1;
$i -= 1;
$i--; // декремент

// .=
$str = 'a';
$str = $str . 'b';
$str .= 'b';

// == сравнение
if (1 == 1) { // true

}

if (1 == '1') { // true

}

// != отрицание
if (1 != 2) { // true

}

// !== отрицание
if (1 !== 2) { // true

}

if (1 !== '1') { // true

}

// === сравнение с учетом типов
if (1 === 1) { // true

}

if (1 === '1') { // false

}

// &&(and) И
$i = 4;
if ($i > 2 && $i < 5) { // true

}

// ||(or) ИЛИ
$i = 4;
if ($i == 2 || $i == 4) { // true

}

// > БОЛЬШЕ
if (2 > 1) { // true

}

// >= БОЛЬШЕ ИЛИ РАВНО
if (1 >= 1) { // true

}

// < МЕНЬШЕ
if (1 < 2) { // true

}

// <= МЕНЬШЕ ИЛИ РАВНО
if (1 <= 1) { // true

}

// + ПЛЮС
1 + 1;

// - МИНУС
2 - 1;

// * УМНОЖЕНИЕ
2 * 2;

// / ДЕЛЕНИЕ
4 / 2;

// % ДЕЛЕНИЕ ПО МОДУЛЮ
echo 9 % 2; // 1
